cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.c
/**
 ******************************************************************************
 * @file    stm32fxx_hal_eth.c
 * @author  MCD Application Team
 * @version V1.3.2
 * @date    26-June-2015
 * @brief   ETH HAL module driver.
 *          This file provides firmware functions to manage the following
 *          functionalities of the Ethernet (ETH) peripheral:
 *           + Initialization and de-initialization functions
 *           + IO operation functions
 *           + Peripheral Control functions
 *           + Peripheral State and Errors functions
 *
 * @verbatim
 * ==============================================================================
 ##### How to use this driver #####
 #####==============================================================================
 #####[..]
 #####(#)Declare a ETH_HandleTypeDef handle structure, for example:
 #####   ETH_HandleTypeDef  heth;
 #####
 #####(#)Fill parameters of Init structure in heth handle
 #####
 #####(#)Call HAL_ETH_Init() API to initialize the Ethernet peripheral (MAC, DMA, ...)
 #####
 #####(#)Initialize the ETH low level resources through the HAL_ETH_MspInit() API:
 #####    (##) Enable the Ethernet interface clock using
 #####         (+++) __HAL_RCC_ETHMAC_CLK_ENABLE();
 #####         (+++) __HAL_RCC_ETHMACTX_CLK_ENABLE();
 #####         (+++) __HAL_RCC_ETHMACRX_CLK_ENABLE();
 #####
 #####    (##) Initialize the related GPIO clocks
 #####    (##) Configure Ethernet pin-out
 #####    (##) Configure Ethernet NVIC interrupt (IT mode)
 #####
 #####(#)Initialize Ethernet DMA Descriptors in chain mode and point to allocated buffers:
 #####    (##) HAL_ETH_DMATxDescListInit(); for Transmission process
 #####    (##) HAL_ETH_DMARxDescListInit(); for Reception process
 #####
 #####(#)Enable MAC and DMA transmission and reception:
 #####    (##) HAL_ETH_Start();
 #####
 #####(#)Prepare ETH DMA TX Descriptors and give the hand to ETH DMA to transfer
 #####   the frame to MAC TX FIFO:
 #####   (##) HAL_ETH_TransmitFrame();
 #####
 #####(#)Poll for a received frame in ETH RX DMA Descriptors and get received
 #####   frame parameters
 #####   (##) HAL_ETH_GetReceivedFrame(); (should be called into an infinite loop)
 #####
 #####(#) Get a received frame when an ETH RX interrupt occurs:
 #####   (##) HAL_ETH_GetReceivedFrame_IT(); (called in IT mode only)
 #####
 #####(#) Communicate with external PHY device:
 #####   (##) Read a specific register from the PHY
 #####        HAL_ETH_ReadPHYRegister();
 #####   (##) Write data to a specific RHY register:
 #####        HAL_ETH_WritePHYRegister();
 #####
 #####(#) Configure the Ethernet MAC after ETH peripheral initialization
 #####    HAL_ETH_ConfigMAC(); all MAC parameters should be filled.
 #####
 #####(#) Configure the Ethernet DMA after ETH peripheral initialization
 #####    HAL_ETH_ConfigDMA(); all DMA parameters should be filled.
 #####
 #####-@- The PTP protocol and the DMA descriptors ring mode are not supported
 #####    in this driver
 #####
 #####@endverbatim
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/

#if defined( STM32F7xx )
    #include "stm32f7xx_hal.h"
    #define stm_is_F7    1
#elif defined( STM32F407xx ) || defined( STM32F417xx ) || defined( STM32F427xx ) || defined( STM32F437xx ) || defined( STM32F429xx ) || defined( STM32F439xx )
    #include "stm32f4xx_hal.h"
    #define stm_is_F4    1
#elif defined( STM32F2xx )
    #include "stm32f2xx_hal.h"
    #define stm_is_F2    1
#else
    #error For what part should this be compiled?
#endif

#include "stm32fxx_hal_eth.h"

/** @addtogroup STM32F4xx_HAL_Driver
 * @{
 */

/** @defgroup ETH ETH
 * @brief ETH HAL module driver
 * @{
 */

#if !defined( ARRAY_SIZE )
    #define ARRAY_SIZE( x )    ( sizeof( x ) / sizeof( x )[ 0 ] )
#endif

#ifdef HAL_ETH_MODULE_ENABLED

    #if ( stm_is_F2 != 0 || stm_is_F4 != 0 || stm_is_F7 )

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/** @defgroup ETH_Private_Constants ETH Private Constants
 * @{
 */

/**
 * @}
 */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

/** @defgroup ETH_Private_Functions ETH Private Functions
 * @{
 */
        static void ETH_MACDMAConfig( ETH_HandleTypeDef * heth,
                                      uint32_t err );
        static void ETH_MACAddressConfig( ETH_HandleTypeDef * heth,
                                          uint32_t MacAddr,
                                          uint8_t * Addr );
        static void ETH_MACReceptionEnable( ETH_HandleTypeDef * heth );
        static void ETH_MACReceptionDisable( ETH_HandleTypeDef * heth );
        static void ETH_MACTransmissionEnable( ETH_HandleTypeDef * heth );
        static void ETH_MACTransmissionDisable( ETH_HandleTypeDef * heth );
        static void ETH_DMATransmissionEnable( ETH_HandleTypeDef * heth );
        static void ETH_DMATransmissionDisable( ETH_HandleTypeDef * heth );
        static void ETH_DMAReceptionEnable( ETH_HandleTypeDef * heth );
        static void ETH_DMAReceptionDisable( ETH_HandleTypeDef * heth );
        static void ETH_FlushTransmitFIFO( ETH_HandleTypeDef * heth );

/**
 * @}
 */
/* Private functions ---------------------------------------------------------*/

/** @defgroup ETH_Exported_Functions ETH Exported Functions
 * @{
 */

/** @defgroup ETH_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief   Initialization and Configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### Initialization and de-initialization functions #####
 #####===============================================================================
 #####[..]  This section provides functions allowing to:
 #####(+) Initialize and configure the Ethernet peripheral
 #####(+) De-initialize the Ethernet peripheral
 #####
 #####@endverbatim
 * @{
 */
        extern void vMACBProbePhy( void );

/**
 * @brief  Initializes the Ethernet MAC and DMA according to default
 *         parameters.
 * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
        HAL_StatusTypeDef HAL_ETH_Init( ETH_HandleTypeDef * heth )
        {
            uint32_t tmpreg = 0uL;
            uint32_t hclk = 60000000uL;
            uint32_t err = ETH_SUCCESS;

            /* Check the ETH peripheral state */
            if( heth == NULL )
            {
                return HAL_ERROR;
            }

            /* Check parameters */
            assert_param( IS_ETH_AUTONEGOTIATION( heth->Init.AutoNegotiation ) );
            assert_param( IS_ETH_RX_MODE( heth->Init.RxMode ) );
            assert_param( IS_ETH_CHECKSUM_MODE( heth->Init.ChecksumMode ) );
            assert_param( IS_ETH_MEDIA_INTERFACE( heth->Init.MediaInterface ) );

            if( heth->State == HAL_ETH_STATE_RESET )
            {
                /* Init the low level hardware : GPIO, CLOCK, NVIC. */
                HAL_ETH_MspInit( heth );
            }

            /* Enable SYSCFG Clock */
            __HAL_RCC_SYSCFG_CLK_ENABLE();

            /* Select MII or RMII Mode*/
            SYSCFG->PMC &= ~( SYSCFG_PMC_MII_RMII_SEL );
            SYSCFG->PMC |= ( uint32_t ) heth->Init.MediaInterface;

            /* Ethernet Software reset */
            /* Set the SWR bit: resets all MAC subsystem internal registers and logic */
            /* After reset all the registers holds their respective reset values */
            /* Also enable EDFE: Enhanced descriptor format enable. */
            heth->Instance->DMABMR |= ETH_DMABMR_SR | ETH_DMABMR_EDE;

            /* Wait for software reset */
            while( ( heth->Instance->DMABMR & ETH_DMABMR_SR ) != ( uint32_t ) RESET )
            {
                /* If your program hangs here, please check the value of 'ipconfigUSE_RMII'. */
            }

