cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.c
                /* Set ETH HAL State to BUSY_RD */
                heth->State = HAL_ETH_STATE_BUSY_RD;

                /* Get the ETHERNET MACMIIAR value */
                tmpreg = heth->Instance->MACMIIAR;

                /* Keep only the CSR Clock Range CR[2:0] bits value */
                tmpreg &= ~ETH_MACMIIAR_CR_MASK;

                /* Prepare the MII address register value */
                tmpreg |= ( ( ( uint32_t ) heth->Init.PhyAddress << 11 ) & ETH_MACMIIAR_PA ); /* Set the PHY device address   */
                tmpreg |= ( ( ( uint32_t ) PHYReg << 6 ) & ETH_MACMIIAR_MR );                 /* Set the PHY register address */
                tmpreg &= ~ETH_MACMIIAR_MW;                                                   /* Set the read mode            */
                tmpreg |= ETH_MACMIIAR_MB;                                                    /* Set the MII Busy bit         */

                /* Write the result value into the MII Address register */
                heth->Instance->MACMIIAR = tmpreg;

                /* Get tick */
                tickstart = HAL_GetTick();

                /* Check for the Busy flag */
                while( 1 )
                {
                    tmpreg = heth->Instance->MACMIIAR;

                    if( ( tmpreg & ETH_MACMIIAR_MB ) == 0uL )
                    {
                        /* Get MACMIIDR value */
                        *RegValue = ( uint32_t ) heth->Instance->MACMIIDR;
                        xResult = HAL_OK;
                        break;
                    }

                    /* Check for the Timeout */
                    if( ( HAL_GetTick() - tickstart ) > PHY_READ_TO )
                    {
                        xResult = HAL_TIMEOUT;
                        break;
                    }
                }

                /* Set ETH HAL State to READY */
                heth->State = HAL_ETH_STATE_READY;

                /* Process Unlocked */
                __HAL_UNLOCK( heth );
            }

            /* Return function status */
            return xResult;
        }

/**
 * @brief  Writes to a PHY register.
 * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  PHYReg: PHY register address, is the index of one of the 32 PHY register.
 *          This parameter can be one of the following values:
 *             PHY_BCR: Transceiver Control Register.
 *             More PHY register could be written depending on the used PHY
 * @param  RegValue: the value to write
 * @retval HAL status
 */
        HAL_StatusTypeDef HAL_ETH_WritePHYRegister( ETH_HandleTypeDef * heth,
                                                    uint16_t PHYReg,
                                                    uint32_t RegValue )
        {
            uint32_t tmpreg = 0;
            uint32_t tickstart = 0;
            HAL_StatusTypeDef xResult;

            /* Check parameters */
            assert_param( IS_ETH_PHY_ADDRESS( heth->Init.PhyAddress ) );

            /* Check the ETH peripheral state */
            if( heth->State == HAL_ETH_STATE_BUSY_WR )
            {
                xResult = HAL_BUSY;
            }
            else
            {
                __HAL_LOCK( heth );

                /* Set ETH HAL State to BUSY_WR */
                heth->State = HAL_ETH_STATE_BUSY_WR;

                /* Get the ETHERNET MACMIIAR value */
                tmpreg = heth->Instance->MACMIIAR;

                /* Keep only the CSR Clock Range CR[2:0] bits value */
                tmpreg &= ~ETH_MACMIIAR_CR_MASK;

                /* Prepare the MII register address value */
                tmpreg |= ( ( ( uint32_t ) heth->Init.PhyAddress << 11 ) & ETH_MACMIIAR_PA ); /* Set the PHY device address */
                tmpreg |= ( ( ( uint32_t ) PHYReg << 6 ) & ETH_MACMIIAR_MR );                 /* Set the PHY register address */
                tmpreg |= ETH_MACMIIAR_MW;                                                    /* Set the write mode */
                tmpreg |= ETH_MACMIIAR_MB;                                                    /* Set the MII Busy bit */

                /* Give the value to the MII data register */
                heth->Instance->MACMIIDR = ( uint16_t ) RegValue;

                /* Write the result value into the MII Address register */
                heth->Instance->MACMIIAR = tmpreg;

                /* Get tick */
                tickstart = HAL_GetTick();

                /* Check for the Busy flag */
                while( 1 )
                {
                    tmpreg = heth->Instance->MACMIIAR;

                    if( ( tmpreg & ETH_MACMIIAR_MB ) == 0ul )
                    {
                        xResult = HAL_OK;
                        break;
                    }

                    /* Check for the Timeout */
                    if( ( HAL_GetTick() - tickstart ) > PHY_WRITE_TO )
                    {
                        xResult = HAL_TIMEOUT;
                        break;
                    }
                }

                /* Set ETH HAL State to READY */
                heth->State = HAL_ETH_STATE_READY;
                /* Process Unlocked */
                __HAL_UNLOCK( heth );
            }

            /* Return function status */
            return xResult;
        }

/**
 * @}
 */

/** @defgroup ETH_Exported_Functions_Group3 Peripheral Control functions
 *  @brief    Peripheral Control functions
 *
 * @verbatim
 * ===============================================================================
 ##### Peripheral Control functions #####
 #####===============================================================================
 #####[..]  This section provides functions allowing to:
 #####(+) Enable MAC and DMA transmission and reception.
 #####    HAL_ETH_Start();
 #####(+) Disable MAC and DMA transmission and reception.
 #####    HAL_ETH_Stop();
 #####(+) Set the MAC configuration in runtime mode
 #####    HAL_ETH_ConfigMAC();
 #####(+) Set the DMA configuration in runtime mode
 #####    HAL_ETH_ConfigDMA();
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Enables Ethernet MAC and DMA reception/transmission
 * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
        HAL_StatusTypeDef HAL_ETH_Start( ETH_HandleTypeDef * heth )
        {
            /* Process Locked */
            __HAL_LOCK( heth );

