cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.c
            /* Set the ETH peripheral state to BUSY */
            heth->State = HAL_ETH_STATE_BUSY;

            /* Enable transmit state machine of the MAC for transmission on the MII */
            ETH_MACTransmissionEnable( heth );

            /* Enable receive state machine of the MAC for reception from the MII */
            ETH_MACReceptionEnable( heth );

            /* Flush Transmit FIFO */
            ETH_FlushTransmitFIFO( heth );

            /* Start DMA transmission */
            ETH_DMATransmissionEnable( heth );

            /* Start DMA reception */
            ETH_DMAReceptionEnable( heth );

            /* Set the ETH state to READY*/
            heth->State = HAL_ETH_STATE_READY;

            /* Process Unlocked */
            __HAL_UNLOCK( heth );

            /* Return function status */
            return HAL_OK;
        }

/**
 * @brief  Stop Ethernet MAC and DMA reception/transmission
 * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
        HAL_StatusTypeDef HAL_ETH_Stop( ETH_HandleTypeDef * heth )
        {
            /* Process Locked */
            __HAL_LOCK( heth );

            /* Set the ETH peripheral state to BUSY */
            heth->State = HAL_ETH_STATE_BUSY;

            /* Stop DMA transmission */
            ETH_DMATransmissionDisable( heth );

            /* Stop DMA reception */
            ETH_DMAReceptionDisable( heth );

            /* Disable receive state machine of the MAC for reception from the MII */
            ETH_MACReceptionDisable( heth );

            /* Flush Transmit FIFO */
            ETH_FlushTransmitFIFO( heth );

            /* Disable transmit state machine of the MAC for transmission on the MII */
            ETH_MACTransmissionDisable( heth );

            /* Set the ETH state*/
            heth->State = HAL_ETH_STATE_READY;

            /* Process Unlocked */
            __HAL_UNLOCK( heth );

            /* Return function status */
            return HAL_OK;
        }

        static void vRegisterDelay()
        {
            uint32_t uxCount;

            /*
             * Regarding the HAL delay functions, I noticed that HAL delay is being used to workaround the
             * "Successive write operations to the same register might not be fully taken into account" errata.
             * The workaround requires a delay of four TX_CLK/RX_CLK clock cycles. For a 10 Mbit connection,
             * these clocks are running at 2.5 MHz, so this delay would be at most 1.6 microseconds.
             * 180 Mhz = 288 loops
             * 168 Mhz = 269 loops
             * 100 Mhz = 160 loops
             *  84 Mhz = 134 loops
             */
        #define WAIT_TIME_NS    1600uL          /* 1.6 microseconds */
        #define CPU_MAX_FREQ    SystemCoreClock /* 84, 100, 168 or 180 MHz */
            uint32_t NOP_COUNT = ( WAIT_TIME_NS * ( CPU_MAX_FREQ / 1000uL ) ) / 1000000uL;

            for( uxCount = NOP_COUNT; uxCount > 0uL; uxCount-- )
            {
                __NOP();
            }
        }

        static void prvWriteMACFCR( ETH_HandleTypeDef * heth,
                                    uint32_t ulValue )
        {
            /* Enable the MAC transmission */
            heth->Instance->MACFCR = ulValue;

            /* Wait until the write operation will be taken into account:
             * at least four TX_CLK/RX_CLK clock cycles.
             * Read it back, wait a ms and */
            ( void ) heth->Instance->MACFCR;

            vRegisterDelay();

            heth->Instance->MACFCR = ulValue;
        }

        static void prvWriteDMAOMR( ETH_HandleTypeDef * heth,
                                    uint32_t ulValue )
        {
            /* Enable the MAC transmission */
            heth->Instance->DMAOMR = ulValue;

            /* Wait until the write operation will be taken into account:
             * at least four TX_CLK/RX_CLK clock cycles.
             * Read it back, wait a ms and */
            ( void ) heth->Instance->DMAOMR;

            vRegisterDelay();

            heth->Instance->DMAOMR = ulValue;
        }

        static void prvWriteMACCR( ETH_HandleTypeDef * heth,
                                   uint32_t ulValue )
        {
            /* Enable the MAC transmission */
            heth->Instance->MACCR = ulValue;

            /* Wait until the write operation will be taken into account:
             * at least four TX_CLK/RX_CLK clock cycles.
             * Read it back, wait a ms and */
            ( void ) heth->Instance->MACCR;

            vRegisterDelay();

            heth->Instance->MACCR = ulValue;
        }

/**
 * @brief  Set ETH MAC Configuration.
 * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  macconf: MAC Configuration structure
 * @retval HAL status
 */
        HAL_StatusTypeDef HAL_ETH_ConfigMAC( ETH_HandleTypeDef * heth,
                                             ETH_MACInitTypeDef * macconf )
        {
            uint32_t tmpreg = 0uL;

            /* Process Locked */
            __HAL_LOCK( heth );

            /* Set the ETH peripheral state to BUSY */
            heth->State = HAL_ETH_STATE_BUSY;

            assert_param( IS_ETH_SPEED( heth->Init.Speed ) );
            assert_param( IS_ETH_DUPLEX_MODE( heth->Init.DuplexMode ) );

            if( macconf != NULL )
            {
                /* Check the parameters */
                assert_param( IS_ETH_WATCHDOG( macconf->Watchdog ) );
                assert_param( IS_ETH_JABBER( macconf->Jabber ) );
                assert_param( IS_ETH_INTER_FRAME_GAP( macconf->InterFrameGap ) );
                assert_param( IS_ETH_CARRIER_SENSE( macconf->CarrierSense ) );
                assert_param( IS_ETH_RECEIVE_OWN( macconf->ReceiveOwn ) );
                assert_param( IS_ETH_LOOPBACK_MODE( macconf->LoopbackMode ) );
                assert_param( IS_ETH_CHECKSUM_OFFLOAD( macconf->ChecksumOffload ) );
                assert_param( IS_ETH_RETRY_TRANSMISSION( macconf->RetryTransmission ) );
                assert_param( IS_ETH_AUTOMATIC_PADCRC_STRIP( macconf->AutomaticPadCRCStrip ) );
                assert_param( IS_ETH_BACKOFF_LIMIT( macconf->BackOffLimit ) );
                assert_param( IS_ETH_DEFERRAL_CHECK( macconf->DeferralCheck ) );
                assert_param( IS_ETH_RECEIVE_ALL( macconf->ReceiveAll ) );
                assert_param( IS_ETH_SOURCE_ADDR_FILTER( macconf->SourceAddrFilter ) );
                assert_param( IS_ETH_CONTROL_FRAMES( macconf->PassControlFrames ) );
                assert_param( IS_ETH_BROADCAST_FRAMES_RECEPTION( macconf->BroadcastFramesReception ) );
                assert_param( IS_ETH_DESTINATION_ADDR_FILTER( macconf->DestinationAddrFilter ) );
                assert_param( IS_ETH_PROMISCUOUS_MODE( macconf->PromiscuousMode ) );
                assert_param( IS_ETH_MULTICAST_FRAMES_FILTER( macconf->MulticastFramesFilter ) );
                assert_param( IS_ETH_UNICAST_FRAMES_FILTER( macconf->UnicastFramesFilter ) );
                assert_param( IS_ETH_PAUSE_TIME( macconf->PauseTime ) );
                assert_param( IS_ETH_ZEROQUANTA_PAUSE( macconf->ZeroQuantaPause ) );
                assert_param( IS_ETH_PAUSE_LOW_THRESHOLD( macconf->PauseLowThreshold ) );
                assert_param( IS_ETH_UNICAST_PAUSE_FRAME_DETECT( macconf->UnicastPauseFrameDetect ) );
                assert_param( IS_ETH_RECEIVE_FLOWCONTROL( macconf->ReceiveFlowControl ) );
                assert_param( IS_ETH_TRANSMIT_FLOWCONTROL( macconf->TransmitFlowControl ) );
                assert_param( IS_ETH_VLAN_TAG_COMPARISON( macconf->VLANTagComparison ) );
                assert_param( IS_ETH_VLAN_TAG_IDENTIFIER( macconf->VLANTagIdentifier ) );

