cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.c
            /* Wait until the write operation will be taken into account:
             * at least four TX_CLK/RX_CLK clock cycles */
            tmpreg = heth->Instance->DMABMR;
            vRegisterDelay();
            heth->Instance->DMABMR = tmpreg;

            /* Set the ETH state to Ready */
            heth->State = HAL_ETH_STATE_READY;

            /* Process Unlocked */
            __HAL_UNLOCK( heth );

            /* Return function status */
            return HAL_OK;
        }

/**
 * @}
 */

/** @defgroup ETH_Exported_Functions_Group4 Peripheral State functions
 *  @brief   Peripheral State functions
 *
 * @verbatim
 * ===============================================================================
 ##### Peripheral State functions #####
 #####===============================================================================
 #####[..]
 #####This subsection permits to get in run-time the status of the peripheral
 #####and the data flow.
 ##### (+) Get the ETH handle state:
 #####     HAL_ETH_GetState();
 #####
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Return the ETH HAL state
 * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL state
 */
        HAL_ETH_StateTypeDef HAL_ETH_GetState( ETH_HandleTypeDef * heth )
        {
            /* Return ETH state */
            return heth->State;
        }

/**
 * @}
 */

/**
 * @}
 */

/** @addtogroup ETH_Private_Functions
 * @{
 */

/**
 * @brief  Configures Ethernet MAC and DMA with default parameters.
 * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  err: Ethernet Init error
 * @retval HAL status
 */
        static void ETH_MACDMAConfig( ETH_HandleTypeDef * heth,
                                      uint32_t err )
        {
            ETH_MACInitTypeDef macinit;
            ETH_DMAInitTypeDef dmainit;
            uint32_t tmpreg = 0uL;

            if( err != ETH_SUCCESS ) /* Auto-negotiation failed */
            {
                /* Set Ethernet duplex mode to Full-duplex */
                heth->Init.DuplexMode = ETH_MODE_FULLDUPLEX;

                /* Set Ethernet speed to 100M */
                heth->Init.Speed = ETH_SPEED_100M;
            }

            /* Ethernet MAC default initialization **************************************/
            macinit.Watchdog = ETH_WATCHDOG_ENABLE;
            macinit.Jabber = ETH_JABBER_ENABLE;
            macinit.InterFrameGap = ETH_INTERFRAMEGAP_96BIT;
            macinit.CarrierSense = ETH_CARRIERSENCE_ENABLE;
            macinit.ReceiveOwn = ETH_RECEIVEOWN_ENABLE;
            macinit.LoopbackMode = ETH_LOOPBACKMODE_DISABLE;

            if( heth->Init.ChecksumMode == ETH_CHECKSUM_BY_HARDWARE )
            {
                macinit.ChecksumOffload = ETH_CHECKSUMOFFLAOD_ENABLE;
            }
            else
            {
                macinit.ChecksumOffload = ETH_CHECKSUMOFFLAOD_DISABLE;
            }

            macinit.RetryTransmission = ETH_RETRYTRANSMISSION_DISABLE;
            macinit.AutomaticPadCRCStrip = ETH_AUTOMATICPADCRCSTRIP_DISABLE;
            macinit.BackOffLimit = ETH_BACKOFFLIMIT_10;
            macinit.DeferralCheck = ETH_DEFFERRALCHECK_DISABLE;
            macinit.ReceiveAll = ETH_RECEIVEAll_DISABLE;
            macinit.SourceAddrFilter = ETH_SOURCEADDRFILTER_DISABLE;
            macinit.PassControlFrames = ETH_PASSCONTROLFRAMES_BLOCKALL;
            macinit.BroadcastFramesReception = ETH_BROADCASTFRAMESRECEPTION_ENABLE;
            macinit.DestinationAddrFilter = ETH_DESTINATIONADDRFILTER_NORMAL;
            macinit.PromiscuousMode = ETH_PROMISCUOUS_MODE_DISABLE;
            macinit.MulticastFramesFilter = ETH_MULTICASTFRAMESFILTER_PERFECT;
            macinit.UnicastFramesFilter = ETH_UNICASTFRAMESFILTER_PERFECT;
            macinit.HashTableHigh = 0x0uL;
            macinit.HashTableLow = 0x0uL;
            macinit.PauseTime = 0x0uL;
            macinit.ZeroQuantaPause = ETH_ZEROQUANTAPAUSE_DISABLE;
            macinit.PauseLowThreshold = ETH_PAUSELOWTHRESHOLD_MINUS4;
            macinit.UnicastPauseFrameDetect = ETH_UNICASTPAUSEFRAMEDETECT_DISABLE;
            macinit.ReceiveFlowControl = ETH_RECEIVEFLOWCONTROL_DISABLE;
            macinit.TransmitFlowControl = ETH_TRANSMITFLOWCONTROL_DISABLE;
            macinit.VLANTagComparison = ETH_VLANTAGCOMPARISON_16BIT;
            macinit.VLANTagIdentifier = 0x0uL;

            /*------------------------ ETHERNET MACCR Configuration --------------------*/
            /* Get the ETHERNET MACCR value */
            tmpreg = heth->Instance->MACCR;
            /* Clear WD, PCE, PS, TE and RE bits */
            tmpreg &= ETH_MACCR_CLEAR_MASK;
            /* Set the WD bit according to ETH Watchdog value */
            /* Set the JD: bit according to ETH Jabber value */
            /* Set the IFG bit according to ETH InterFrameGap value */
            /* Set the DCRS bit according to ETH CarrierSense value */
            /* Set the FES bit according to ETH Speed value */
            /* Set the DO bit according to ETH ReceiveOwn value */
            /* Set the LM bit according to ETH LoopbackMode value */
            /* Set the DM bit according to ETH Mode value */
            /* Set the IPCO bit according to ETH ChecksumOffload value */
            /* Set the DR bit according to ETH RetryTransmission value */
            /* Set the ACS bit according to ETH AutomaticPadCRCStrip value */
            /* Set the BL bit according to ETH BackOffLimit value */
            /* Set the DC bit according to ETH DeferralCheck value */
            tmpreg |= ( uint32_t ) ( macinit.Watchdog |
                                     macinit.Jabber |
                                     macinit.InterFrameGap |
                                     macinit.CarrierSense |
                                     heth->Init.Speed |
                                     macinit.ReceiveOwn |
                                     macinit.LoopbackMode |
                                     heth->Init.DuplexMode |
                                     macinit.ChecksumOffload |
                                     macinit.RetryTransmission |
                                     macinit.AutomaticPadCRCStrip |
                                     macinit.BackOffLimit |
                                     macinit.DeferralCheck );

