cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.c
            /* Write to ETHERNET MACCR */
            prvWriteMACCR( heth, tmpreg );

            /*----------------------- ETHERNET MACFFR Configuration --------------------*/
            /* Set the RA bit according to ETH ReceiveAll value */
            /* Set the SAF and SAIF bits according to ETH SourceAddrFilter value */
            /* Set the PCF bit according to ETH PassControlFrames value */
            /* Set the DBF bit according to ETH BroadcastFramesReception value */
            /* Set the DAIF bit according to ETH DestinationAddrFilter value */
            /* Set the PR bit according to ETH PromiscuousMode value */
            /* Set the PM, HMC and HPF bits according to ETH MulticastFramesFilter value */
            /* Set the HUC and HPF bits according to ETH UnicastFramesFilter value */
            /* Write to ETHERNET MACFFR */
            heth->Instance->MACFFR = ( uint32_t ) ( macinit.ReceiveAll |
                                                    macinit.SourceAddrFilter |
                                                    macinit.PassControlFrames |
                                                    macinit.BroadcastFramesReception |
                                                    macinit.DestinationAddrFilter |
                                                    macinit.PromiscuousMode |
                                                    macinit.MulticastFramesFilter |
                                                    macinit.UnicastFramesFilter );

            /* Wait until the write operation will be taken into account:
             * at least four TX_CLK/RX_CLK clock cycles */
            tmpreg = heth->Instance->MACFFR;
            vRegisterDelay();
            heth->Instance->MACFFR = tmpreg;

            /*--------------- ETHERNET MACHTHR and MACHTLR Configuration --------------*/
            /* Write to ETHERNET MACHTHR */
            heth->Instance->MACHTHR = ( uint32_t ) macinit.HashTableHigh;

            /* Write to ETHERNET MACHTLR */
            heth->Instance->MACHTLR = ( uint32_t ) macinit.HashTableLow;
            /*----------------------- ETHERNET MACFCR Configuration -------------------*/

            /* Get the ETHERNET MACFCR value */
            tmpreg = heth->Instance->MACFCR;
            /* Clear xx bits */
            tmpreg &= ETH_MACFCR_CLEAR_MASK;

            /* Set the PT bit according to ETH PauseTime value */
            /* Set the DZPQ bit according to ETH ZeroQuantaPause value */
            /* Set the PLT bit according to ETH PauseLowThreshold value */
            /* Set the UP bit according to ETH UnicastPauseFrameDetect value */
            /* Set the RFE bit according to ETH ReceiveFlowControl value */
            /* Set the TFE bit according to ETH TransmitFlowControl value */
            tmpreg |= ( uint32_t ) ( ( macinit.PauseTime << 16 ) |
                                     macinit.ZeroQuantaPause |
                                     macinit.PauseLowThreshold |
                                     macinit.UnicastPauseFrameDetect |
                                     macinit.ReceiveFlowControl |
                                     macinit.TransmitFlowControl );

            /* Write to ETHERNET MACFCR */
            prvWriteMACFCR( heth, tmpreg );

            /*----------------------- ETHERNET MACVLANTR Configuration ----------------*/
            /* Set the ETV bit according to ETH VLANTagComparison value */
            /* Set the VL bit according to ETH VLANTagIdentifier value */
            heth->Instance->MACVLANTR = ( uint32_t ) ( macinit.VLANTagComparison |
                                                       macinit.VLANTagIdentifier );

            /* Wait until the write operation will be taken into account:
             * at least four TX_CLK/RX_CLK clock cycles */
            tmpreg = heth->Instance->MACVLANTR;
            vRegisterDelay();
            heth->Instance->MACVLANTR = tmpreg;

            /* Ethernet DMA default initialization ************************************/
            dmainit.DropTCPIPChecksumErrorFrame = ETH_DROPTCPIPCHECKSUMERRORFRAME_ENABLE;
            dmainit.ReceiveStoreForward = ETH_RECEIVESTOREFORWARD_ENABLE;
            dmainit.FlushReceivedFrame = ETH_FLUSHRECEIVEDFRAME_ENABLE;
            dmainit.TransmitStoreForward = ETH_TRANSMITSTOREFORWARD_ENABLE;
            dmainit.TransmitThresholdControl = ETH_TRANSMITTHRESHOLDCONTROL_64BYTES;
            dmainit.ForwardErrorFrames = ETH_FORWARDERRORFRAMES_DISABLE;
            dmainit.ForwardUndersizedGoodFrames = ETH_FORWARDUNDERSIZEDGOODFRAMES_DISABLE;
            dmainit.ReceiveThresholdControl = ETH_RECEIVEDTHRESHOLDCONTROL_64BYTES;
            dmainit.SecondFrameOperate = ETH_SECONDFRAMEOPERARTE_ENABLE;
            dmainit.AddressAlignedBeats = ETH_ADDRESSALIGNEDBEATS_ENABLE;
            dmainit.FixedBurst = ETH_FIXEDBURST_ENABLE;
            dmainit.RxDMABurstLength = ETH_RXDMABURSTLENGTH_32BEAT;
            dmainit.TxDMABurstLength = ETH_TXDMABURSTLENGTH_32BEAT;
            dmainit.EnhancedDescriptorFormat = ETH_DMAENHANCEDDESCRIPTOR_ENABLE;
            dmainit.DescriptorSkipLength = 0x0uL;
            dmainit.DMAArbitration = ETH_DMAARBITRATION_ROUNDROBIN_RXTX_1_1;

            /* Get the ETHERNET DMAOMR value */
            tmpreg = heth->Instance->DMAOMR;
            /* Clear xx bits */
            tmpreg &= ETH_DMAOMR_CLEAR_MASK;

            /* Set the DT bit according to ETH DropTCPIPChecksumErrorFrame value */
            /* Set the RSF bit according to ETH ReceiveStoreForward value */
            /* Set the DFF bit according to ETH FlushReceivedFrame value */
            /* Set the TSF bit according to ETH TransmitStoreForward value */
            /* Set the TTC bit according to ETH TransmitThresholdControl value */
            /* Set the FEF bit according to ETH ForwardErrorFrames value */
            /* Set the FUF bit according to ETH ForwardUndersizedGoodFrames value */
            /* Set the RTC bit according to ETH ReceiveThresholdControl value */
            /* Set the OSF bit according to ETH SecondFrameOperate value */
            tmpreg |= ( uint32_t ) ( dmainit.DropTCPIPChecksumErrorFrame |
                                     dmainit.ReceiveStoreForward |
                                     dmainit.FlushReceivedFrame |
                                     dmainit.TransmitStoreForward |
                                     dmainit.TransmitThresholdControl |
                                     dmainit.ForwardErrorFrames |
                                     dmainit.ForwardUndersizedGoodFrames |
                                     dmainit.ReceiveThresholdControl |
                                     dmainit.SecondFrameOperate );

            /* Write to ETHERNET DMAOMR */
            prvWriteDMAOMR( heth, tmpreg );

